In [2]:
import pandas as pd
data = [10, 20, 30, 40]
series = pd.Series(data)
series

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
series = pd.Series(data, index=['a', 'b', 'c', 'd'])
series

a    10
b    20
c    30
d    40
dtype: int64

In [6]:
# Creating a DataFrame from a dictionary
data = {
    'Name': ['Alice', 'Bob', 'Chalier'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Chalier   35      Chicago

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [16]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [9]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [14]:
df['Age'] = df['Age'].astype('float32')

In [15]:
df.dtypes

Name     object
Age     float32
City     object
dtype: object